<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta http-equiv="CACHE-CONTROL" content="NO-CACHE">
<meta http-equiv="imagetoolbar" content="no">
<meta name="MSSmartTagsPreventParsing" content="true">
<title>Changelog</title>
<script type="text/javascript">
            
            function createCSSClass(selector, style)
            {
                // using information found at: http://www.quirksmode.org/dom/w3c_css.html
                // doesn't work in older versions of Opera (&lt; 9) due to lack of styleSheets support
                if(!document.styleSheets) return;
                if(document.getElementsByTagName("head").length == 0) return;
                var stylesheet;
                var mediaType;
                if(document.styleSheets.length > 0)
                {
                    for(i = 0; i < document.styleSheets.length; i++)
                    {
                        if(document.styleSheets[i].disabled) continue;
                        var media = document.styleSheets[i].media;
                        mediaType = typeof media;
                        // IE
                        if(mediaType == "string")
                        {
                            if(media == "" || media.indexOf("screen") != -1)
                            {
                                styleSheet = document.styleSheets[i];
                            }
                        }
                        else if(mediaType == "object")
                        {
                            if(media.mediaText == "" || media.mediaText.indexOf("screen") != -1)
                            {
                                styleSheet = document.styleSheets[i];
                            }
                        }
                        // stylesheet found, so break out of loop
                        if(typeof styleSheet != "undefined") break;
                    }
                }
                // if no style sheet is found
                if(typeof styleSheet == "undefined")
                {
                    // create a new style sheet
                    var styleSheetElement = document.createElement("style");
                    styleSheetElement.type = "text/css";
                    // add to <head>
                    document.getElementsByTagName("head")[0].appendChild(styleSheetElement);
                    // select it
                    for(i = 0; i<document.styleSheets.length; i++)
                    {
                        if(document.styleSheets[i].disabled) continue;
                        styleSheet = document.styleSheets[i];
                    }
                    // get media type
                    var media = styleSheet.media;
                    mediaType = typeof media;
                }
                // IE
                if(mediaType == "string")
                {
                    for(i = 0;i<styleSheet.rules.length;i++)
                    {
                        // if there is an existing rule set up, replace it
                        if(styleSheet.rules[i].selectorText.toLowerCase() == selector.toLowerCase())
                        {
                            styleSheet.rules[i].style.cssText = style;
                            return;
                        }
                    }
                    // or add a new rule
                    styleSheet.addRule(selector,style);
                }
                else if(mediaType == "object")
                {
                    for(i = 0;i<styleSheet.cssRules.length;i++)
                    {
                        // if there is an existing rule set up, replace it
                        if(styleSheet.cssRules[i].selectorText && styleSheet.cssRules[i].selectorText.toLowerCase() == selector.toLowerCase())
                        {
                            styleSheet.cssRules[i].style.cssText = style;
                            return;
                        }
                    }
                    // or insert new rule
                    styleSheet.insertRule(selector + "{" + style + "}", styleSheet.cssRules.length);
                }
            }
            function LanguageSetCookie(lang){
                var a = new Date();
                a = new Date(a.getTime() + 1000 * 60 * 60 * 24 * 90);
                document.cookie = lang+'; expires=' + a.toGMTString() + ';';
            }

            function getLanguageFromCookie(){
                var cook = document.cookie;
                if(cook!="de" && cook!="en")
                    return "de";//Std Lang
                return cook;
            }
            function changeLang(lang){
                //hide old
                createCSSClass("."+CurrentLanguage.toLowerCase(),"")
                //set new
                LanguageSetCookie(lang);
                CurrentLanguage = getLanguageFromCookie();
                createCSSClass("."+CurrentLanguage.toLowerCase(),"display:block!important;")
            }

            CurrentLanguage = getLanguageFromCookie();
            createCSSClass("."+CurrentLanguage.toLowerCase(),"display:block!important;")
            if(window.top.location.href.indexOf("start.html")==-1)
                createCSSClass("#langsel","display:block!important;")


        </script>
<style type="text/css">

            .version{
                display:none;
            }
            body{
                background:white;
            }
            #langsel{
                     padding:10px;
            }
            #langsel a{
                     padding-left:10px;
            }
            
        </style>
</head>
<body>
<div id="langsel">
<span><a href="javascript:changeLang('de')">Deutsch</a><a href="javascript:changeLang('en')">English</a></span>
</div>
<h1>Changelog</h1>


<div class="version de">
<h2>Version 7.0.1</h2>
<ul>
<li>In der Energietabelle Datumsanzeigen um Wochentag erweitert</li>
<li>Englische Hilfe f&uuml;r Weboberfl&auml;che der GridVis-Energy hinzugef&uuml;gt</li>
<li>Erweiterung der JanDB um Kompatibilit&auml;t mit Benutzerverwaltung</li>
<li>Funktionalit&auml;t "Passwort vergessen" zum Zur&uuml;cksetzen des Passworts hinzugef&uuml;gt</li>
<li>Copy &amp; Paste Funktion f&uuml;r Dashboards</li>
<li>Behoben: Im Excel-Export f&uuml;r Verbr&auml;uche mit frei ausw&auml;hlbaren Zeitbereichen sind die Werte um den Faktor 1000 zu niedrig</li>
<li>Behoben: Sporadischer Faktorfehler in der Spektralanalyse</li>
<li>Behoben: Stabilit&auml;tsprobleme im Liniendiagramm</li>
<li>Ortsauswahl bei Wetter-Widgets auf Editormodus beschr&auml;nkt</li>
<li>Behoben: Diverse Anzeigefehler im IE</li>
<li>Behoben: Fehlerhafte Widgets konnten nicht gel&ouml;scht werden</li>
<li>Behoben: Darstellungsfehler NaN im Gauge</li>
<li>Behoben: Multibargraph Widget funktioniert nicht, wenn "Reihenfolge" bei Darstellung gew&auml;hlt wird</li>
<li>Behoben: Home Button wird erst nach dem 2. Mal Dr&uuml;cken blau</li>
<li>Behoben: Virtuelles Element f&uuml;r den Analogeingang Livewert funktioniert nach Update auf 6.0.2 nicht mehr</li>
</ul>
</div>
<div class="version en">
<h2>Version 7.0.1</h2>
<ul>
<li>Added day of week to date fields in Energy Table</li>
<li>Added Help in English language for GridVis-Energy WebInterface</li>
<li>Added User Management compatibility to JanDB</li>
<li>Added "Password forgotten" functionality to reset password</li>
<li>Copy &amp; Paste functionality for Dashboards</li>
<li>Fixed: In Consumption Excel Export with freely-selectable timeranges, consumption values are at a too low rate of factor 1000</li>
<li>Fixed: Temporarily erroneous factor in spectral analysis</li>
<li>Fixed: Stability issues in Line Chart</li>
<li>Restricted location selectivity for Weather Widgets to edit mode</li>
<li>Fixed: Some display errors in IE</li>
<li>Fixed: Erroneous Widgets could not be deleted</li>
<li>Fixed: Display error for NaN in Gauge</li>
<li>Fixed: Multibargraph Widget does not work if display mode is set to "order"</li>
<li>Fixed: Home Button does not change its colour to blue before second press</li>
<li>Fixed: Virtual element for analogue input live value has not worked since upgrade to 6.0.2</li>
</ul>
</div>
<div class="version de">
<h2>Version 7.0.0</h2>
<ul>
<li>Neu: manuelle Eingabe Ger&auml;t 2.0</li>
<li>MSSQL 2014 wird unterst&uuml;tzt (Treiber Anpassung)</li>
<li>Neu: Excel Report Verbrauchs&uuml;bersicht (Jahres&uuml;bersicht)</li>
<li>Neu: Excel Report Verbrauchs&uuml;bersicht (2 Perioden)</li>
<li>Planer Lizenzen Begrenzung auf f&uuml;nf Ger&auml;te (ab der Enterprise Edition)</li>
<li>Basic Edition muss nicht mehr aktiviert werden</li>
<li>Behoben: Instabilit&auml;ten im Datenbankmanager</li>
<li>Lizenz File Direkt Download (Lizenzserver)</li>
<li>UMG96 RM-PN wird unterst&uuml;tzt</li>
<li>Windows 10 wird unterst&uuml;tzt</li>
<li>Neu: Weboberfl&auml;che "GridVis Energy" (enthalten in der Ultimate Edition) | Ger&auml;te&uuml;bersicht | Dashboard und Template Funktion | Benutzerverwaltung | verbesserte Systemeinstellung | Bild-Manager</li>
<li>Behoben: Schaltuhr-Konfiguration f&uuml;r ProData2 erlaubt nun Endzeit von 24:00 Uhr</li>
<li>Behoben: Das L&ouml;schen von Daten aus der Datenbank dauert zu lange</li>
<li>Behoben: Fehler in Berechnung der Wirkleistung f&uuml;r Digitaleing&auml;nge der Ger&auml;te UMG104, UMG508, UMG509, UMG511, UMG512, UMG604, UMG605 </li>
<li>Behoben: Upgrade von UMG96RM-E verursacht ein Resourcen-Leck f&uuml;r UDP-Ports</li>
<li>Behoben: Das L&ouml;schen von sehr gro&szlig;en Datenbl&ouml;cken aus MSSQL Datenbanken schl&auml;gt fehl</li>
<li>Behoben: Fehler in Topologie-Ansicht UMG20CM</li>
<li>Optimierungen in der Modbus Kommunikation</li>
<li>Behoben: Persistierung von globalen Array-Werten, z.B. "_ULN[1]"</li>
<li>Behoben: Alarmsystem verursacht hohe CPU Last</li>
<li>Behoben: Gro&szlig;e negative Zahlen wurden auf Milli skaliert</li>
</ul>
</div>
<div class="version en">
<h2>Version 7.0.0</h2>
<ul>
<li>New: manual input device 2.0</li>
<li>MSSQL 2014 is supported (Driver adjusted)</li>
<li>New: Excel report Energy Consumption Overview (current and last year)</li>
<li>New: Excel report Energy Consumption Overview (2 user-configurable periods)</li>
<li>Consultant license is limited to five devices (starting from Enterprise Edition)</li>
<li>Basic Edition no longer needs activation</li>
<li>Fixed: Instability issues in Databasemanager</li>
<li>Lizense File Direct Download (Lizenseserver)</li>
<li>UMG96 RM-PN is supported</li>
<li>Windows 10 is supported</li>
<li>New: Web UI "GridVis Energy" (included in Ultimate Edition) | Device overview | Dashboard and Template function | User administration | improved system settings | Picture Manager</li>
<li>Fixed: Clocktimer configuration for ProData2 allows 24:00 o'clock as end time now</li>
<li>Fixed: Deleting data from the database takes too much time</li>
<li>Fixed: failure in calculation of digital input's power value for devices UMG104, UMG508, UMG509, UMG511, UMG512, UMG604, UMG605</li>
<li>Fixed: Upgrade of UMG96RM-E causes a resource-leak for UDP-ports</li>
<li>Fixed: Deleting huge data blocks from MSSQL databases fails</li>
<li>Fixed: Error in topology image for UMG20CM</li>
<li>Optimizations for modbus communication</li>
<li>Fixed: Persistance for global array values, e.g. "_ULN[1]"</li>
<li>Fixed: The alarm system caused a high CPU usage</li>
<li>Fixed: Large negative numbers were scaled to milli</li>
</ul>
</div>
<div class="version de">
<h2>Version 6.0.5</h2>
<ul>
<li>MSSQL 2014 wird unterst&uuml;tzt (Treiber Anpassung)</li>
<li>Behoben: Instabilit&auml;ten im Datenbankmanager</li>
<li>Behoben: Schaltuhr-Konfiguration f&uuml;r ProData2 erlaubt nun Endzeit von 24:00 Uhr</li>
<li>Behoben: Das L&ouml;schen von sehr gro&szlig;en Datenbl&ouml;cken aus MSSQL Datenbanken schl&auml;gt fehl</li>
<li>Optimierungen in der Modbus Kommunikation</li>
<li>Behoben: Persistierung von globalen Array-Werten, z.B. "_ULN[1]"</li>
</ul>
</div>
<div class="version en">
<h2>Version 6.0.5</h2>
<ul>
<li>MSSQL 2014 is supported (Driver adjusted)</li>
<li>Fixed: Instability issues in Databasemanager</li>
<li>Fixed: Clocktimer configuration for ProData2 allows 24:00 o'clock as end time now</li>
<li>Fixed: Deleting huge data blocks from MSSQL databases fails</li>
<li>Optimizations for modbus communication</li>
<li>Fixed: Persistance for global array values, e.g. "_ULN[1]"</li>
</ul>
</div>
<div class="version de">
<h2>Version 6.0.4</h2>
<ul>
<li>Behoben: Das L&ouml;schen von Daten aus der Datenbank dauert zu lange</li>
<li>Behoben: Alarmsystem verursacht hohe CPU Last</li>
<li>Behoben: Gro&szlig;e negative Zahlen wurden auf Milli skaliert</li>
</ul>
</div>
<div class="version en">
<h2>Version 6.0.4</h2>
<ul>
<li>Fixed: Deleting data from the database takes too much time</li>
<li>Fixed: The alarm system caused a high CPU usage</li>
<li>Fixed: Large negative numbers were scaled to milli</li>
</ul>
</div>
<div class="version de">
<h2>Version 6.0.3</h2>
<ul>
<li>Behoben: Wenn viele Ger&auml;te nicht erreichbar sind, wurden gar keine Werte mehr geholt</li>
<li>Topologie: Tooltip mit Ger&auml;teinformationen bei ger&auml;terelevanten Widgets hinzugef&uuml;gt</li>
<li>Topologie: Widgets &uuml;berlappen nicht mehr beim Hinzuf&uuml;gen</li>
<li>Verbindungstest funktioniert ohne virtuelle Ger&auml;te</li>
<li>Italienische &Uuml;bersetzungen hinzugef&uuml;gt</li>
<li>Die Ereignis/Transientenanzeige kann ausgedruckt werden</li>
<li>Die GridVis-Defaultfarben werden auch im Zeigerdiagram verwendet</li>
<li>Harmonische aus historischen Daten werden normgerecht dargestellt</li>
<li>Behoben: Speicherleck im Generischen Modbus</li>
<li>Behoben: Online Erfassung aktualisiert den Zeitpunkt des letzten Wertes auch wenn keine Kommunikation zustande kam</li>
<li>Behoben: Export und Import der Ger&auml;teliste funktioniert nicht mit Verbindung &uuml;ber HTTP oder EasyGateway</li>
<li>Behoben: Die Datenverdichtung l&ouml;scht online erfasste Werte nicht mehr</li>
<li>Behoben: Globale Werte konnten online nicht &uuml;ber REST abgerufen werden</li>
<li>Behoben: Fehler in Upgrade-Wizard wenn Ger&auml;t ohne Verbindung als erstes seines Typs</li>
</ul>
</div>
<div class="version en">
<h2>Version 6.0.3</h2>
<ul>
<li>Fixed: If lots of devices were unreachable, not any value was fetched</li>
<li>Topology: Added tooltip with device information for device-relevant widgets</li>
<li>Topology: There are not any overlaps any longer when adding widgets</li>
<li>Connection test works without any Virtual Devices</li>
<li>Added italian translation</li>
<li>It is possible to print the event/transient view </li>
<li>Phasor graph uses the GridVis default colours now</li>
<li>Historical Harmonics are displayed conforming to standards</li>
<li>Fixed: Memory leak in generic modbus</li>
<li>Fixed: Online recording refreshed the time of last synced value even though communication failed</li>
<li>Fixed: Import or Export of device list did not work for devices connected by HTTP or EasyGateway</li>
<li>Fixed: Online recorded values are no longer deleted when accumulating values</li>
<li>Fixed: Global Values could not be requested online via REST</li>
<li>Fixed: Error in upgrade-wizard if device without connection inserted at first position</li>
</ul>
</div>
<div class="version de">
<h2>Version 6.0.2</h2>
<ul>
<li>Behoben: Namen benutzerdefinierter Werte k&ouml;nnen nun 256 Zeichen lang sein</li>
<li>Die Jahresauswertung produziert weniger F&uuml;llspalten</li>
<li>Die Jahresauswertung erlaubt mehr Platz f&uuml;r den Ger&auml;tenamen</li>
<li>Der Verbindungszustand kann &uuml;ber REST abgefragt werden</li>
<li>Ein/Ausgangskonfiguration &uuml;berarbeitet f&uuml;r UMG96RM-PN</li>
<li>JRE auf Version 1.8.0_45 angehoben</li>
<li>Behoben: Ger&auml;teausfallereignisse werden nicht richtig ausgewertet</li>
<li>Behoben: Auslesefehler bei UMG507</li>
<li>PDF-Export f&uuml;r Energierechnungen</li>
<li>Behoben: Byte-Reihenfolge der Profibusprofile war bei UMG 96RM-P &auml;nderbar</li>
<li>Behoben: Das virtuelle Ger&auml;t liefert manchmal keine Online Werte</li>
<li>Behoben: Ereignis-Konfiguration UMG96RM-E: Schwellwert wurde teilweise falsch dargestellt.</li>
<li>Manuelles Eingabeger&auml;t funktioniert nun f&uuml;r gel&ouml;schte Bereiche.</li>
<li>Es k&ouml;nnen keine falschen Verzeichnisse als Projekte in den GridVis Service geladen werden</li>
</ul>
</div>
<div class="version en">
<h2>Version 6.0.2</h2>
<ul>
<li>Fixed: Names of user defined values may contain 256 characters now</li>
<li>The annual cost report produces less gap columns</li>
<li>The annual cost report allows more room for the device name</li>
<li>The connection state can be requesed via our REST interface</li>
<li>I/O config has been restructured for UMG96RM-PN</li>
<li>Raised JRE Version to 1.8.0_45</li>
<li>Fixed: Device outage events are not evaluated correctly</li>
<li>Fixed: Error while synchronizing a UMG507</li>
<li>pdf export for energy invoices</li>
<li>Fixed: Byte order of profibus profiles could be changed for UMG 96RM-P</li>
<li>Fixed: Sometimes the virtual device does not produce online values</li>
<li>Fixed: event configuration of UMG96RM-E: in certain cases threshold value was not correctly displayed.</li>
<li>Manuel input device works also for deleted regions.</li>
<li>It is no longer possible to load arbitrary directories as projects into a GridVis Service</li>
</ul>
</div>
<div class="version de">
<h2>Version 6.0.1</h2>
<ul>
<li>Bessere Anzeige von Messwerten auf dem Dienst</li>
<li>Behoben: Die Ger&auml;teansicht bleibt leer wenn die Sprache gewechselt wurde</li>
<li>Behoben: Werden Generische Modbusprofile ge&auml;ndert kann der Service abst&uuml;rzen</li>
<li>Behoben: GridVis zeigt Einheiten benutzerdefinierter Aufzeichnungswerte nicht mehr an</li>
<li>Behoben: Im EN50160/IEEE519 Report werden die Spannungsereignisse nicht mehr eingruppiert</li>
<li>Behoben: GridVis friert ein wenn viel Kommunikation &uuml;ber ein ModBus Gateway gef&uuml;hrt wird</li>
<li>Behoben: F&uuml;r das UMG 20CM ist der Grenzwert f&uuml;r Strom nun bis 600.000 A einstellbar.</li>
<li>Behoben: F&uuml;r den Analysekanal des UMG 20CM werden die Onlinewerte nicht geholt.</li>
</ul>
</div>
<div class="version en">
<h2>Version 6.0.1</h2>
<ul>
<li>Better graph component for the GridVis service</li>
<li>Fixed: Device overview is empty when the language has been changed</li>
<li>Fixed: Crash of GridVis Service when a generic modbus profile has been changed</li>
<li>Fixed: GridVis does not show the unit of user defined values</li>
<li>Fixed: In EN50160/IEEE519 Report, voltage events are not categorized any more</li>
<li>Fixed: GridVis freezes when a lot of communication has been transfered over a ModBus Gateway</li>
<li>Fixed: limit for current monitoring can be set up to 600,000 A for UMG 20CM.</li>
<li>Fixed:  the online values of the analysis channel could not be displayed (UMG 20CM).</li>
</ul>
</div>
<div class="version de">
<h2>Version 6.0.0</h2>
<ul>
<li>Behoben: Fehler bei Speicher Auslesung des UMG507.</li>
<li>Blinken des Displays kann f&uuml;r das UMG 96RM konfiguriert werden</li>
<li>Messwerte lassen sich in gr&ouml;&szlig;ere Zeitbasen kumulieren</li>
<li>Unterst&uuml;tzung f&uuml;r das Easy Gateway EG400-HE</li>
<li>Service: Mailversand nutzt eine neuere Implementierung.</li>
<li>Neues Design f&uuml;r den GridVis Dienst</li>
<li>Behoben: Excel export startete einen Messwert sp&auml;ter als in vorherigen Versionen</li>
<li>Behoben: Reporte und Exporte werden immer mit gleichem Datum ausgef&uuml;hrt</li>
<li>Behoben: Feldbus Profile k&ouml;nnen f&uuml;r das UMG96 RM-P auch ohne Verbindung konfiguriert werden</li>
<li>Behoben: Fehler in der Ereigniskonfiguration beim Laden der Ger&auml;tekonfiguration</li>
<li>Behoben: Nicht alle COM Ports werden erkannt in Windows 8.1</li>
<li>Behoben: Fehler beim Schlie&szlig;en der Verbindungseinstellugen ohne &Auml;nderungen.</li>
<li>Behoben: Virtuelles Ger&auml;te berechnet Intervallwerte falsch</li>
<li>Behoben: Die Einstellung der Feldbus-Profile hat in der &Uuml;bersicht die Bytereigenfolge verdreht dargestellt.</li>
<li>Behoben: Zeitpl&auml;ne werden als Folge einer Ab&auml;nderung und Zuweisung zu Ger&auml;ten in der verantwortlichen GridVis-Instanz fehlerhaft &uuml;bernommen.</li>
</ul>
</div>
<div class="version en">
<h2>Version 6.0.0</h2>
<ul>
<li>Fixed: Errors while downloading memory from UMG507.</li>
<li>Flashing display can be configured for UMG 96RM</li>
<li>Measuring values can be accumulated to higher time bases</li>
<li>Support for Easy Gateway EG400-HE</li>
<li>Service: Mail delivery implementation updated.</li>
<li>New design for GridVis Service</li>
<li>Fixed: Excel export begun one measuring point later than earlier versions</li>
<li>Fixed: Reports and Exports are always executed with the same time frames</li>
<li>Fixed: Field bus profiles can be configured for UMG96 RM-P without connection</li>
<li>Fixed: Event configuration was marked as erroneous for some devices</li>
<li>Fixed: Not all COM Ports are detected windows 8.1</li>
<li>Fixed: Error if the device connection dialog was closed without any change.</li>
<li>Fixed: Virtual device fails to correctly calculate interval values</li>
<li>Fixed: configuration of field bus profiles displayed the opposite byte order in the list.</li>
<li>Fixed: Schedules, when being changed and reassigned to devices, are not applied correctly within the responsible GridVis instance.</li>
</ul>
</div>
<div class="version de">
<h2>Version 5.1.4</h2>
<ul>
<li>Speicher des Prodata 2 kann zur&uuml;ckgesetzt werden</li>
<li>Behoben: Globale Werte und gemappte Namen konnten nicht mehr in Excel-Exporten verwendet werden.</li>
<li>Behoben: Wandlereinstellung des UMG510 kann nicht mehr an das Ger&auml;t &uuml;bertagen werden</li>
</ul>
</div>
<div class="version en">
<h2>Version 5.1.4</h2>
<ul>
<li>Memory of Prodata 2 can be reseted</li>
<li>Fixed: Global values and mapped I/O names could not be longer used within Excel exports.</li>
<li>Fixed: Transformer setting can not be send to a UMG510</li>
</ul>
</div>
</body>
</html>
