<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta http-equiv="CACHE-CONTROL" content="NO-CACHE">
<meta http-equiv="imagetoolbar" content="no">
<meta name="MSSmartTagsPreventParsing" content="true">
<title>Changelog</title>
<script type="text/javascript">
            
            function createCSSClass(selector, style)
            {
                // using information found at: http://www.quirksmode.org/dom/w3c_css.html
                // doesn't work in older versions of Opera (&lt; 9) due to lack of styleSheets support
                if(!document.styleSheets) return;
                if(document.getElementsByTagName("head").length == 0) return;
                var stylesheet;
                var mediaType;
                if(document.styleSheets.length > 0)
                {
                    for(i = 0; i < document.styleSheets.length; i++)
                    {
                        if(document.styleSheets[i].disabled) continue;
                        var media = document.styleSheets[i].media;
                        mediaType = typeof media;
                        // IE
                        if(mediaType == "string")
                        {
                            if(media == "" || media.indexOf("screen") != -1)
                            {
                                styleSheet = document.styleSheets[i];
                            }
                        }
                        else if(mediaType == "object")
                        {
                            if(media.mediaText == "" || media.mediaText.indexOf("screen") != -1)
                            {
                                styleSheet = document.styleSheets[i];
                            }
                        }
                        // stylesheet found, so break out of loop
                        if(typeof styleSheet != "undefined") break;
                    }
                }
                // if no style sheet is found
                if(typeof styleSheet == "undefined")
                {
                    // create a new style sheet
                    var styleSheetElement = document.createElement("style");
                    styleSheetElement.type = "text/css";
                    // add to <head>
                    document.getElementsByTagName("head")[0].appendChild(styleSheetElement);
                    // select it
                    for(i = 0; i<document.styleSheets.length; i++)
                    {
                        if(document.styleSheets[i].disabled) continue;
                        styleSheet = document.styleSheets[i];
                    }
                    // get media type
                    var media = styleSheet.media;
                    mediaType = typeof media;
                }
                // IE
                if(mediaType == "string")
                {
                    for(i = 0;i<styleSheet.rules.length;i++)
                    {
                        // if there is an existing rule set up, replace it
                        if(styleSheet.rules[i].selectorText.toLowerCase() == selector.toLowerCase())
                        {
                            styleSheet.rules[i].style.cssText = style;
                            return;
                        }
                    }
                    // or add a new rule
                    styleSheet.addRule(selector,style);
                }
                else if(mediaType == "object")
                {
                    for(i = 0;i<styleSheet.cssRules.length;i++)
                    {
                        // if there is an existing rule set up, replace it
                        if(styleSheet.cssRules[i].selectorText && styleSheet.cssRules[i].selectorText.toLowerCase() == selector.toLowerCase())
                        {
                            styleSheet.cssRules[i].style.cssText = style;
                            return;
                        }
                    }
                    // or insert new rule
                    styleSheet.insertRule(selector + "{" + style + "}", styleSheet.cssRules.length);
                }
            }
            function LanguageSetCookie(lang){
                var a = new Date();
                a = new Date(a.getTime() + 1000 * 60 * 60 * 24 * 90);
                document.cookie = lang+'; expires=' + a.toGMTString() + ';';
            }

            function getLanguageFromCookie(){
                var cook = document.cookie;
                if(cook!="de" && cook!="en")
                    return "de";//Std Lang
                return cook;
            }
            function changeLang(lang){
                //hide old
                createCSSClass("."+CurrentLanguage.toLowerCase(),"")
                //set new
                LanguageSetCookie(lang);
                CurrentLanguage = getLanguageFromCookie();
                createCSSClass("."+CurrentLanguage.toLowerCase(),"display:block!important;")
            }

            CurrentLanguage = getLanguageFromCookie();
            createCSSClass("."+CurrentLanguage.toLowerCase(),"display:block!important;")
            if(window.top.location.href.indexOf("start.html")==-1)
                createCSSClass("#langsel","display:block!important;")


        </script>
<style type="text/css">

            .version{
                display:none;
            }
            body{
                background:white;
            }
            #langsel{
                     padding:10px;
            }
            #langsel a{
                     padding-left:10px;
            }
            
        </style>
</head>
<body>
<div id="langsel">
<span><a href="javascript:changeLang('de')">Deutsch</a><a href="javascript:changeLang('en')">English</a></span>
</div>
<h1>Changelog</h1>


<div class="version de">
<h2>Version 5.1.4</h2>
<ul>
<li>Speicher des Prodata 2 kann zur&uuml;ckgesetzt werden</li>
<li>Behoben: Globale Werte und gemappte Namen konnten nicht mehr in Excel-Exporten verwendet werden.</li>
<li>Behoben: Wandlereinstellung des UMG510 kann nicht mehr an das Ger&auml;t &uuml;bertagen werden</li>
</ul>
</div>
<div class="version en">
<h2>Version 5.1.4</h2>
<ul>
<li>Memory of Prodata 2 can be reseted</li>
<li>Fixed: Global values and mapped I/O names could not be longer used within Excel exports.</li>
<li>Fixed: Transformer setting can not be send to a UMG510</li>
</ul>
</div>
<div class="version de">
<h2>Version 5.1.3</h2>
<ul>
<li>Unterst&uuml;tzung f&uuml;r UMG 96RM-PN hinzugef&uuml;gt</li>
<li>Daten k&ouml;nnen nach einen Zeitplan gel&ouml;scht werden</li>
<li>Das UMG 96RM-CBM kann als eingest&auml;ndiges Ger&auml;t hinzugef&uuml;gt werden</li>
<li>Das UMG 96RM-P kann als eingest&auml;ndiges Ger&auml;t hinzugef&uuml;gt werden</li>
<li>Das UMG 96RM-E kann als eingest&auml;ndiges Ger&auml;t hinzugef&uuml;gt werden</li>
<li>Ger&auml;te k&ouml;nnen nach einen Zeitplan aus der Datenbank gel&ouml;scht werden</li>
<li>In der Ereignis/Transientenansicht kann im Graphen gemessen werden</li>
<li>In der Ereignis/Transientenansicht kann der Zoom &uuml;ber einen Button zur&uuml;ckgesetzt werden</li>
<li>Globale Werte k&ouml;nnen in der GridVis jetzt durchg&auml;ngiger verwendet werden</li>
<li>Behoben: Wandlereinstellungen des UMG 509 werden nicht richtig ausgelesen</li>
<li>Lizenzinformationen werden auf dem Dienst klarer dargestellt</li>
<li>Das generische Modbus Ger&auml;t unterst&uuml;tzt bis zu 4 Nachkommastellen</li>
<li>Copy und Paste funktioniert in der Topologie</li>
<li>Behoben: Dienst lie&szlig;t Ger&auml;te nicht mehr aus wenn eine MS SQL als Datenbank verwendet wird</li>
<li>Behoben: Vergleicherkonfiguration f&uuml;r verschiedenen Ger&auml;te konnte nicht aus Datei geladen werden</li>
<li>Behoben: Jahresauswertung f&uuml;r Verbrauch berechnet die Gesamtkosten falsch</li>
<li>Behoben: Exporte k&ouml;nnen nicht mit online erfassten Daten durchgef&uuml;hrt werden</li>
<li>Behoben: Falsche Ermittlung der Z&auml;hlerst&auml;nde in der Verbrauchsabrechnung</li>
<li>Behoben: Werte in Reporten und Exporten sind nicht mehr sortiert</li>
<li>Behoben: &Auml;nderungen am Generischen Modbus Profil werden vom GridVis Dienst nicht &uuml;bernommen</li>
<li>Behoben: Energieberechnung unter Umst&auml;nden fehlerhaft wenn die Aufzeichnungskonfiguration ge&auml;ndert wurde</li>
<li>Behoben: Ger&auml;tename wurde in Reports nicht angezeigt</li>
<li>Behoben: &Auml;nderungen am Virtuellen Ger&auml;t werden vom GridVis Dienst nicht &uuml;bernommen</li>
</ul>
</div>
<div class="version en">
<h2>Version 5.1.3</h2>
<ul>
<li>Support for UMG 96RM-PN added</li>
<li>Values can be deleted according to a schedule</li>
<li>The UMG 96RM-CBM can be choosen directly when adding a new device</li>
<li>The UMG 96RM-P can be choosen directly when adding a new device</li>
<li>The UMG 96RM-E can be choosen directly when adding a new device</li>
<li>Devices can be deleted from the database according to a schedule</li>
<li>Its possible to meassure in the event/transient view</li>
<li>In event/transient view a button was added to reset the zoom level</li>
<li>It is easier to use global values throughout GridVis</li>
<li>Fixed: Transformer settings are loaded incorrectly from UMG 509</li>
<li>License information are displayed more concisely</li>
<li>The generic modbus device now supports up to 4 decimal places</li>
<li>Copy and paste now works for the topology</li>
<li>Fixed: Service stopped synchronizing devices when a MS SQL database is beeing used</li>
<li>Fixed: Loading a comparator configuration from a file fails for some devices</li>
<li>Fixed: Cost overview does not calculate the total cost correctly</li>
<li>Fixed: Online recorded values could not be used for data exports</li>
<li>Fixed: Wrong counter state calculation in Metering Report</li>
<li>Fixed: Values in reports and exports where no longer sorted</li>
<li>Fixed: Changes to the generic modbus profile are not recognized by the GridVis service</li>
<li>Fixed: Energy calculation in some cases faulty when the recording configuration was changed</li>
<li>Fixed: Device name was not shown in reports</li>
<li>Fixed: Changes to the virtual device are not recognized by the GridVis service</li>
</ul>
</div>
<div class="version de">
<h2>Version 5.1.2</h2>
<ul>
<li>Neue Darstellung von Ereignissen und Transienten</li>
<li>In der Topologie k&ouml;nnen Links auf Exporte/Reporte angelegt werden</li>
<li>Im Alarmmanagement und bei den Exporten k&ouml;nne die Ger&auml;te nach Namen gefiltert werden</li>
<li>Behoben: Log-Fenster in der Projekt&uuml;bersicht l&auml;sst sich nicht vergr&ouml;&szlig;ern</li>
<li>Stabilit&auml;t der Graphansicht verbessert</li>
<li>Behoben: Statisikansicht verwendet konfigurierte Skalierung nicht</li>
<li>Behoben: Ansicht zum Speicherverbrauch des Dienstes fehlerhaft</li>
<li>Behoben: Einige Messwerte wurden in den Vergleichern nicht gespeichert</li>
<li>Behoben: Auf schnellen Rechnern konnte es vorkommen, dass einzelne  Alarmquellen nicht geladen wurden</li>
<li>Java auf Version 1.8.0_25 angehoben</li>
</ul>
</div>
<div class="version en">
<h2>Version 5.1.2</h2>
<ul>
<li>New visualization of events and transients</li>
<li>Links to exports/reports can be added to the topology</li>
<li>Devices can be filtered in the  alarm system and export configuration</li>
<li>Fixed: Log window in project overview cannot be resized</li>
<li>Improved graph view stability</li>
<li>Fixed: Statistic view does not use configured scaling</li>
<li>Fixed: Memory usage overview of services broken</li>
<li>Fixed: Some values where not saved if they where used in comparator</li>
<li>Fixed: On fast machines it could happen that some alarm sources did not start</li>
<li>Java version raised to 1.8.0_25</li>
</ul>
</div>
<div class="version de">
<h2>Version 5.1.1</h2>
<ul>
<li>16Hz, 60Hz und 400Hz werden auf den Achsen der Onlinewellenformen dargestellt</li>
<li>Statistikreport um statistische Informationen neben Graph erg&auml;nzt</li>
<li>Der HTTP Port des UMG 96RM-E kann konfiguriert werden</li>
<li>HTTP kann zur Auslesung der Jasic Ger&auml;te verwendet werden</li>
<li>RCM Ereignisse des UMG 512 und UMG 509 k&ouml;nnen zur&uuml;ckgesetzt werden</li>
<li>Man kann den Namen der GridVis Installation &auml;ndern</li>
<li>Zeitzonenkonfiguration der Ger&auml;te erfolgt in Stunden</li>
<li>Behoben: Reporte konnten nicht auf UNC Pfaden abgelegt werden</li>
<li>Behoben: Zeigerdiagramm funktioniert nicht mehr</li>
<li>Behoben: Der erweiterte Qualit&auml;tsreport berechnet das ISc/IL Verh&auml;ltnis falsch</li>
<li>Vorlauf in der Ereignisskonfiguration des UMG 512 konnte zu gro&szlig; eingestellt werden</li>
<li>Behoben: Das Aufzeichnungelement der graphischen Programmierung konnte manchmal nicht gespeichert werden</li>
<li>Behoben: vertauschte cap/ind bei der Cos-phi-Anzeige in den Grafiken f&uuml;r UMG96S </li>
</ul>
</div>
<div class="version en">
<h2>Version 5.1.1</h2>
<ul>
<li>Axis for online waveforms can be displayed for 16Hz, 60Hz and 400Hz</li>
<li>Statistic information added to Statistic Report in addition to graph</li>
<li>The HTTP port of the UMG 96RM-E can be configured</li>
<li>HTTP can be used to read from Jasic devices</li>
<li>RCM event of the UMG 512 and UMG 509 can be acknowledged </li>
<li>Name of GridVis installation can be changed</li>
<li>Timezone configuration of the devices now uses hours</li>
<li>Fixed: reports could not be written to UNC paths</li>
<li>Fixed: Phasor graph does not work correctly</li>
<li>Fixed: The enhanced power quality report calculated the ISc/IL ratio correctly</li>
<li>Pretrigger of event configuration for the UMG 512 could be set too high</li>
<li>Fixed: Recording element in visual programming could not always be saved</li>
<li>Fixed: display of cos-phi with inverted cap/ind in graphics for UMG96S </li>
</ul>
</div>
<div class="version de">
<h2>Version 5.1.0</h2>
<ul>
<li>Optionale Ausgabe von Wert-Name und Zeitpunkt f&uuml;r Online-Werte &uuml;ber REST.</li>
<li>In der Alarm&uuml;bersicht k&ouml;nnen Person und Kommentar der Quittierung eingeblendet werden.</li>
<li>UMG20CM: Weitere Wandler der Konfiguration hinzugef&uuml;gt.</li>
<li>Topologie: Neues Widget f&uuml;r historische Verbrauchswerte</li>
<li>4-Quadranten Messwerte f&uuml;r UMG96RM-E und UMG512 hinzugef&uuml;gt.</li>
<li>Konfiguration der BacNet-Einstellungen f&uuml;r UMG508, UMG511, UMG604, UMG605, UMG605us ist m&ouml;glich</li>
<li>Konfiguration der SNMP-Traps f&uuml;r UMG96RM-E.</li>
<li>Konfiguration der BacNet-Einstellungen f&uuml;r UMG96RM-E ist m&ouml;glich</li>
<li>Byteorder und Integerwerte k&ouml;nnen in den Profibusprofilen des UMG96RM-P k&ouml;nnen konfiguriert werden</li>
<li>Neue Alarmquelle ob neue Transienten oder Ereignisse aufgetreten sind.</li>
<li>Speichernutzung ist w&auml;hrend der Installation konfigurierbar</li>
<li>REST-Schnittstelle stellt nun auch die Ger&auml;tebeschreibung bereit.</li>
<li>Unterst&uuml;tzung f&uuml;r UMG509</li>
<li>Es k&ouml;nnen neue Anzeigen auf dem UMG96RM konfiguriert werden</li>
<li>Neue Mindestfirmware f&uuml;r einige Ger&auml;te(siehe Onlinehilfe)</li>
<li>Behoben: Fehlerhafte Grenzwerte f&uuml;r die Harmonischen im EN 61000-2-4 Report</li>
<li>Behoben: REST-Schnittstelle liefert die Namen von umbenannten Eing&auml;ngen f&uuml;r Energie Abfragen nicht aus.</li>
<li>Behoben: Graphachse zeigt die Kalenderwoche der Zeitumstellung doppelt an</li>
<li>Behoben:  Im Zusammenhang mit der Janitza Datenbank und dem L&ouml;schen von Sequenzen konnte es zu Fehlern in den gespeicherten Sequenzen der Datenbank kommen.</li>
<li>Behoben: Als gel&ouml;scht markierte Ger&auml;te erscheinen mit REST-Abfragen.</li>
<li>Behoben: REST-Schnittstelle liefert die Namen von umbenannten Eing&auml;ngen nicht aus.</li>
<li>Die Alarm&uuml;bersicht beh&auml;lt ihre Darstellungseinstellungen bei</li>
<li>Behoben: Zu wenige Nachkommastellen in der Analogausgangskonfiguration des UMG96S</li>
<li>Behoben: Projekt-Import-Dialog &ouml;ffnete sich nicht.</li>
<li>Behoben: Aufgezeichnete Energiewerte in ProData2 werden um Faktor 1000 zu klein abgespeichert</li>
<li>Behoben: Konfiguration Differenzstrommessung f&uuml;r UMG96RME, UMG509, UMG512 l&auml;sst keine Stromwerte kleiner als 1mA zu.</li>
<li>Behoben: F&uuml;r Links in der Topologie fehlten einige Hinweistexte</li>
<li>Behoben: Anzeigefehler bei Aufzeichnungskonfiguration 10 Sekunden nach Norm.</li>
<li>Behoben: Fehler beim Auslesen UMG503</li>
<li>Behoben: Scheduler konnte durch Einstellungs-Dialog beendet werden.</li>
<li>Behoben: Redirect-Loop im GridVis Service</li>
<li>Behoben: Es wird nur der Identit&auml;tsreiter der Ger&auml;tekonfiguration geladen, wenn keine Verbindung zu dem Ger&auml;t hergestellt werden kann.</li>
<li>Behoben: Bei Fest-IP mit ARP Probe konnte keine IP-Adresse eingestellt werden</li>
<li>Behoben: Onlineaufzeichnung f&uuml;r UMG510 wurde nicht persistiert.</li>
<li>Behoben: ProData, UMG507, UMG510 konnten die Online- und Historische-Aufzeichnung nicht gleichzeitig nutzen.</li>
<li>Behoben: Virtuelles Ger&auml;t l&auml;sst sich nicht editieren wenn ein verwendetes Ger&auml;t nicht von der GridVis unterst&uuml;tzt wird</li>
<li>Behoben: Alarmbenachrichtigung wird zu h&auml;ufig angezeigt</li>
<li>Behoben: Aktionen f&uuml;r das Quittieren eines Alarms werden auf zugewiesenem Server ausgef&uuml;hrt.</li>
<li>Benutzerdefinierte Werte k&ouml;nnen aus der Datenbank gel&ouml;scht werden</li>
<li>Der Ausdruck der Energie-&Uuml;bersicht entspricht jetzt dem Report</li>
<li>Globale-Werte k&ouml;nnen in der Online-Erfassung verwendet werden</li>
</ul>
</div>
<div class="version en">
<h2>Version 5.1.0</h2>
<ul>
<li>Optional value name and timestamps for online values via REST.</li>
<li>In Alarm overview acknowledging person and comment can be displayed</li>
<li>UMG20CM: Added additional transformer to configuration.</li>
<li>Topology: New Widget for historical consumption values</li>
<li>4-quadrant measurement for UMG96RM-E and UMG512</li>
<li>Configuration of BacNet-settings for devices UMG508, UMG511, UMG604, UMG605, UMG605us is supported</li>
<li>Configuration of SNMP traps for devices UMG96RM-E.</li>
<li>Configuration of BacNet-settings for UMG96RM-E is supported</li>
<li>The byte order and integer values can be used in profibus profiles on the UMG96RM-P</li>
<li>New alarm source to check whether a new transient or an events occured.</li>
<li>Memory usage can be configured during installation</li>
<li>REST interface does also include the description of a device.</li>
<li>Support for UMG509</li>
<li>New displays can be configured on UMG96RM</li>
<li>New minimal firmware version for several devices(see online help)</li>
<li>Fixed: Wrong limits for harmonics in the EN 61000-2-4 report</li>
<li>Fixed: REST did not include mapped names of inputs for energy requests</li>
<li>Fixed: Graph axis shows the calendar week of the day light saving time twice</li>
<li>Fixed: Under certain circumstances the Janitza DB may corrupt sequence data while deleting sequences.</li>
<li>Fixed: If the device was retrieved with REST that list contained deleted device.</li>
<li>Fixed: REST did not include mapped names of inputs.</li>
<li>Alarm overview keeps its display settings</li>
<li>Fixed: Too few decimal places in analog output configuration for UMG96S</li>
<li>Fixed: Dialog for project import did not open.</li>
<li>Fixed: Energy values recorded in ProData2 are stored too small by factor 1000.</li>
<li>Fixed: rcm-measurement's configuration for UMG96RME, UMG509, UMG512 allowed no current values below 1mA.</li>
<li>Fixed: Some hints where missing on the link element of the topology</li>
<li>Fixed: False time value displayed for recording configuration "10 second according to norm".</li>
<li>Fixed: error while reading historical data from UMG503</li>
<li>Fixed: Scheduler could be stopped by config dialogs.</li>
<li>Fixed: Redirect-Loop in GridVis Service</li>
<li>Fixed: If no connection to device could be established, only identity tab is loaded in device configuration.</li>
<li>Fixed: for the configuration "static ip with ARP probe" no ip could be set.</li>
<li>Fixed: online recording for UMG510 was not saved.</li>
<li>Fixed: ProData, UMG507, UMG510 did not support online and historical recording at the same time.</li>
<li>Fixed: Virtual device is not configuratable when a used device is not supported</li>
<li>Fixed: Alarm notification is shown too often</li>
<li>Fixed: Actions for acknowledge alarms are now executed on the assigned server.</li>
<li>Userdefined values can be deleted from datebase</li>
<li>The printout of the energy overview now looks like the report</li>
<li>Global values can be used for online recording</li>
</ul>
</div>
<div class="version de">
<h2>Version 5.0.5</h2>
<ul>
<li>Optionale Ausgabe von Wert-Name und Zeitpunkt f&uuml;r Online-Werte &uuml;ber REST.</li>
<li>Behoben:  Im Zusammenhang mit der Janitza Datenbank und dem L&ouml;schen von Sequenzen konnte es zu Fehlern in den gespeicherten Sequenzen der Datenbank kommen.</li>
<li>Behoben: Als gel&ouml;scht markierte Ger&auml;te erscheinen mit REST-Abfragen.</li>
<li>Behoben: REST-Schnittstelle liefert die Namen von umbenannten Eing&auml;ngen nicht aus.</li>
</ul>
</div>
<div class="version en">
<h2>Version 5.0.5</h2>
<ul>
<li>Optional value name and timestamps for online values via REST.</li>
<li>Fixed: Under certain circumstances the Janitza DB may corrupt sequence data while deleting sequences.</li>
<li>Fixed: If the device was retrieved with REST that list contained deleted device.</li>
<li>Fixed: REST did not include mapped names of inputs.</li>
</ul>
</div>
<div class="version de">
<h2>Version 5.0.4</h2>
<ul>
<li>Behoben: Energiez&auml;hlst&auml;nde werden nicht mehr in der Ger&auml;te-Konfigurationsdatei gespeichert</li>
<li>Behoben: Dienst funktionierte f&uuml;r bestimmte Sprachen nicht.</li>
<li>Topologie: Verbrauchswidget beh&auml;lt Hintergrundeinstellungen bei</li>
<li>Behoben: Projekt-Import-Dialog &ouml;ffnete sich nicht.</li>
</ul>
</div>
<div class="version en">
<h2>Version 5.0.4</h2>
<ul>
<li>Fixed: Energy counts will not be saved within the device config file anymore</li>
<li>Fixed: service did not work for all languages.</li>
<li>Topology: Consumption Widget keeps background settings</li>
<li>Fixed: Dialog for project import did not open.</li>
</ul>
</div>
<div class="version de">
<h2>Version 5.0.3</h2>
<ul>
<li>Topologie: Neues Widget f&uuml;r historische Verbrauchswerte</li>
<li>Konfiguration der BacNet-Einstellungen f&uuml;r UMG508, UMG511, UMG604, UMG605, UMG605us ist m&ouml;glich</li>
<li>REST-Schnittstelle stellt nun auch die Ger&auml;tebeschreibung bereit.</li>
<li>Die Z&auml;hlst&auml;nde des Prodata 2 k&ouml;nnen konfiguriert werden</li>
<li>Die Z&auml;hlst&auml;nde des UMG96RM k&ouml;nnen konfiguriert werden</li>
<li>Es k&ouml;nnen neue Anzeigen auf dem UMG96RM konfiguriert werden</li>
<li>Behoben: Aufgezeichnete Energiewerte in ProData2 werden um Faktor 1000 zu klein abgespeichert</li>
<li>Behoben: Konfiguration Differenzstrommessung f&uuml;r UMG96RME, UMG509, UMG512 l&auml;sst keine Stromwerte kleiner als 1mA zu.</li>
<li>Behoben: In der RS485 Konfiguration erschien bei einigen Ger&auml;te der Eintrag BACnet IP</li>
<li>Behoben: F&uuml;r Links in der Topologie fehlten einige Hinweistexte</li>
<li>Behoben: Anzeigefehler bei Aufzeichnungskonfiguration 10 Sekunden nach Norm.</li>
<li>Behoben: Fehler beim Auslesen UMG503</li>
<li>Benutzerdefinierte Werte k&ouml;nnen aus der Datenbank gel&ouml;scht werden</li>
</ul>
</div>
<div class="version en">
<h2>Version 5.0.3</h2>
<ul>
<li>Topology: New Widget for historical consumption values</li>
<li>Configuration of BacNet-settings for devices UMG508, UMG511, UMG604, UMG605, UMG605us is supported</li>
<li>REST interface does also include the description of a device.</li>
<li>The counters of the prodata 2 can be set</li>
<li>The counters of the UMG96RM can be set</li>
<li>New displays can be configured on UMG96RM</li>
<li>Fixed: Energy values recorded in ProData2 are stored too small by factor 1000.</li>
<li>Fixed: rcm-measurement's configuration for UMG96RME, UMG509, UMG512 allowed no current values below 1mA.</li>
<li>Fixed: some devices showed an BACnet IP entry for RS485 configuration</li>
<li>Fixed: Some hints where missing on the link element of the topology</li>
<li>Fixed: False time value displayed for recording configuration "10 second according to norm".</li>
<li>Fixed: error while reading historical data from UMG503</li>
<li>Userdefined values can be deleted from datebase</li>
</ul>
</div>
<div class="version de">
<h2>Version 5.0.2</h2>
<ul>
<li>Konfiguration der BacNet-Einstellungen f&uuml;r UMG96RM-E ist m&ouml;glich</li>
<li>Neue Mindestfirmware f&uuml;r einige Ger&auml;te(siehe Onlinehilfe)</li>
<li>Behoben: Scheduler konnte durch Einstellungs-Dialog beendet werden.</li>
<li>Behoben: Redirect-Loop im GridVis Service</li>
<li>Behoben: Es wird nur der Identit&auml;tsreiter der Ger&auml;tekonfiguration geladen, wenn keine Verbindung zu dem Ger&auml;t hergestellt werden kann.</li>
<li>Behoben: Beim Import in das neue Topologie-Format skaliert das Ger&auml;tewidget falsch</li>
<li>&Auml;nderung der Zoomstufe &auml;ndert den Bearbeitungsstatus der Topologie nicht mehr</li>
<li>Behoben: Bei Fest-IP mit ARP Probe konnte keine IP-Adresse eingestellt werden</li>
<li>Behoben: Onlineaufzeichnung f&uuml;r UMG510 wurde nicht persistiert.</li>
<li>Behoben: ProData, UMG507, UMG510 konnten die Online- und Historische-Aufzeichnung nicht gleichzeitig nutzen.</li>
<li>Behoben: Virtuelles Ger&auml;t l&auml;sst sich nicht editieren wenn ein verwendetes Ger&auml;t nicht von der GridVis unterst&uuml;tzt wird</li>
<li>Behoben: Alarmbenachrichtigung wird zu h&auml;ufig angezeigt</li>
<li>Globale-Werte k&ouml;nnen in der Online-Erfassung verwendet werden</li>
</ul>
</div>
<div class="version en">
<h2>Version 5.0.2</h2>
<ul>
<li>Configuration of BacNet-settings for UMG96RM-E is supported</li>
<li>New minimal firmware version for several devices(see online help)</li>
<li>Fixed: Scheduler could be stopped by config dialogs.</li>
<li>Fixed: Redirect-Loop in GridVis Service</li>
<li>Fixed: If no connection to device could be established, only identity tab is loaded in device configuration.</li>
<li>fixed: device widget sizing issues when converting to new topology format</li>
<li>Changing the zoomlevel does no longer change the modified state of the topology</li>
<li>Fixed: for the configuration "static ip with ARP probe" no ip could be set.</li>
<li>Fixed: online recording for UMG510 was not saved.</li>
<li>Fixed: ProData, UMG507, UMG510 did not support online and historical recording at the same time.</li>
<li>Fixed: Virtual device is not configuratable when a used device is not supported</li>
<li>Fixed: Alarm notification is shown too often</li>
<li>Global values can be used for online recording</li>
</ul>
</div>
<div class="version de">
<h2>Version 5.0.1</h2>
<ul>
<li>Ereignisse, Transienten und Sequenzen k&ouml;nnen separat gel&ouml;scht werden</li>
<li>Ausf&uuml;hrung eines Exports wird in der Taskleiste angezeigt</li>
<li>Der Temperaturoffset des UMG96RM-E kann konfiguriert werden</li>
<li>Behoben: Spannungsobergrenze f&uuml;r Qualit&auml;tsreports ist zu niedrig</li>
<li>Janitza DB Optimierungen f&uuml;r das Alarmsystem</li>
<li>Behoben: ModBus-Kommunikation nur bis UnitID 127 m&ouml;glich.</li>
<li>Behoben: Mehrfachselektion von Messwerten bei Exporten f&uuml;r Energie-/Leistungswerte</li>
<li>Erzeugung von Jasic-Datei f&uuml;r BacNet wird entfernt (ersetzt durch BacNet in Ger&auml;te-Konfiguration)</li>
<li>Behoben: Der Prodata 2 &uuml;bernimmt seinen Namen beim CSV Import nicht</li>
<li>Behoben: Das UMG96RM &uuml;bernimmt seinen Namen beim CSV Import nicht</li>
<li>Behoben: Bilder der Anschlussvarianten beim UMG511 falsch</li>
<li>Behoben: Es konnten Profibus Profile mit mehr als 123 Byte angelegt werden</li>
<li>Behoben: Status-Email des Servers f&uuml;hrt gel&ouml;schte Ger&auml;te mit auf</li>
<li>Behoben: SMTP Port ist immer 465 wenn SSL verwendet wird,STARTTLS einzeln ausw&auml;hlbar.</li>
</ul>
</div>
<div class="version en">
<h2>Version 5.0.1</h2>
<ul>
<li>Events, transients and sequences can be deleted separately</li>
<li>A progress bar indicates the execution of an export</li>
<li>The temperature offset can be configured for an UMG96RM-E</li>
<li>Fixed: Upper voltage barrier for Quality Reports is too low</li>
<li>Janitza DB improvements concerning the alarm system</li>
<li>Fixed: ModBus communication was limited to a maximal UnitID of 127.</li>
<li>Fixed: multi selection support for value types in energy/power values exports</li>
<li>Creation of Jasic file for BacNet removed (becomes obsolete due to replacement by BacNet in device's configuration)</li>
<li>Fixed: Prodata 2 does not use the name when importing from CSV file</li>
<li>Fixed: UMG96RM does not use the name when importing from CSV file</li>
<li>Fixed: Images of measuringvariants are wrong for UMG511</li>
<li>Fixed: It was possible to create profibus profiles larger 123 bytes</li>
<li>Fixed: State email sent by service includes deleted devices</li>
<li>Fixed: SMTP port is always 465 when SSL is used, STARTTLS option added.</li>
</ul>
</div>
<div class="version de">
<h2>Version 5.0.0</h2>
<ul>
<li>Janitza DB wird als Standarddatenbank verwendet</li>
<li>Topologie Elemente k&ouml;nnen gleichm&auml;&szlig;ig verteilt werden</li>
<li>Summierkan&auml;le des UMG20CM k&ouml;nnen benannt werden.</li>
<li>Aufzeichnungsl&uuml;cken in der Report&uuml;bersicht dargestellt.</li>
<li>Einstellbarer Gateway-Timeout f&uuml;r UMG604, UMG605, UMG508, UMG511 und UMG104.</li>
<li>Einstellbarer Gateway-Timeout f&uuml;r UMG96RME.</li>
<li>Anwendung kann mehr Speicher nutzen.</li>
<li>Konfigurationswert f&uuml;r Ereignis-Nachlauf f&uuml;r UMG604 und UMG508 entfernt</li>
<li>In der Topologie werden selektierte Elemente hervorgehoben</li>
<li>Mail werden erneut gesendet wenn ein SMTP-Fehler auftritt.</li>
<li>Behoben: Die GridVis friert ein wenn der Toolbarkonfigurator genutzt wird</li>
<li>Behoben: Einheiten und Formatierung im Verbrauchsreport uneinheitlich</li>
<li>Behoben: LastSync kann als Zeit in der Zukunft in der Datenbank abgespeichert werden</li>
<li>Behoben: Unvollst&auml;ndiger PDF-Export des Verbindungstestreports</li>
<li>Behoben: Der Dienst startet eine Redirect Schleife wenn kein Projekt gew&auml;hlt wurde</li>
<li>Behoben: Grenzwertverletzungen in den Reports werden falsch berechnet</li>
<li>Behoben: Virtuelles Ger&auml;t berechnet die Zeitspannen der vorhandenen Daten falsch</li>
<li>Behoben: Projekte k&ouml;nnen nicht vom GridVis Service gel&ouml;st werden</li>
<li>Behoben: Excel Exporte funktionieren mit Online erfassten Werten nicht</li>
<li>Behoben: GridVis bleibt im Projekt Status 'Lade Ger&auml;te' h&auml;ngen</li>
<li>Behoben: Als gel&ouml;scht markierte Ger&auml;te sind in Alarmquellen konfigurierbar</li>
<li>Zust&auml;nde der Digitaleing&auml;nge von UMG96S in Online-Auslesung verf&uuml;gbar</li>
</ul>
</div>
<div class="version en">
<h2>Version 5.0.0</h2>
<ul>
<li>Janitza DB is used as default database</li>
<li>Topology elements can be distributed evenly</li>
<li>Sum channels of UMG20CM can be named.</li>
<li>Overview in reports shows gaps in recordings.</li>
<li>Customizable gateway timeout for UMG604, UMG605, UMG508, UMG511 and UMG104.</li>
<li>Customizable gateway timeout for UMG96RME.</li>
<li>Application can use more memory.</li>
<li>Configuration item for post event values removed for devices UMG604 and UMG508</li>
<li>The topology marks selected Elements</li>
<li>If the SMTP server reports an error there will be a retry.</li>
<li>Fixed: GridVis freezes when the toolbar customizer is used</li>
<li>Fixed: Units and formating of values in the consumption report is inconsistent</li>
<li>Fixed: LastSync can be stored in database as future time</li>
<li>Fixed: Incomplete PDF Export of ConnectionTest Report</li>
<li>Fixed: The service starts a redirect loop when no project is selected</li>
<li>Fixed: number of limit exceedances is not correct</li>
<li>Fixed: The virtual device wrongly calculates time ranges for data available</li>
<li>Fixed: Projects can not be removed from GridVis Service</li>
<li>Fixed: Excel export fail to export online recorded values</li>
<li>Fixed: GridVis stop at project state 'Loading devices'</li>
<li>Fixed: Devices marked as deleted are assignable in alarmsources</li>
<li>State of digital input from UMG96S added to online readings</li>
</ul>
</div>
</body>
</html>
